<a href="https://colab.research.google.com/github/cinthia-cientistadedados/cinthia-cientistadedados/blob/main/IBGE_analiseExploratoriaDeDados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

A v**isualização de dados** é um passo essencial na **Análise Exploratória de Dados (EDA)** e frequentemente precede análises mais avançadas ou modelagem. Este passo visa explorar e visualizar os dados para identificar padrões ou tendências.

A atividade central deste passo é verificar gráficos, tabelas e estatísticas descritivas para explorar os dados.

Ao visualizá-los, podemos identificar anomalias e erros nos dados que podem precisar de correção ou tratamento especial.

Isso permite validar suposições e hipóteses iniciais sobre os dados, ou seja, podemos confirmar ou refutar nossas expectativas sobre como os dados se comportam.

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('arquivo_concatenado.csv')
df

            nome  regiao      freq   rank sexo
0          MARIA       0  11694738      1    F
1            ANA       0   3079729      2    F
2      FRANCISCA       0    721637      3    F
3        ANTONIA       0    588783      4    F
4        ADRIANA       0    565621      5    F
...          ...     ...       ...    ...  ...
19995     RUBIAN       0       265   9993    M
19996      LIZEU       0       265   9984    M
19997     CARKOS       0       265  10001    M
19998     CARLAN       0       265   9977    M
19999     CARLOA       0       265   9991    M

[20000 rows x 5 columns]

In [ ]:
df = df.drop(columns=['regiao'])

In [ ]:
print(df.head())

        nome      freq  rank sexo
0      MARIA  11694738     1    F
1        ANA   3079729     2    F
2  FRANCISCA    721637     3    F
3    ANTONIA    588783     4    F
4    ADRIANA    565621     5    F

In [ ]:
print(df.tail())

         nome  freq   rank sexo
19995  RUBIAN   265   9993    M
19996   LIZEU   265   9984    M
19997  CARKOS   265  10001    M
19998  CARLAN   265   9977    M
19999  CARLOA   265   9991    M

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    20000 non-null  object
 1   freq    20000 non-null  int64
 2   rank    20000 non-null  int64
 3   sexo    20000 non-null  object
dtypes: int64(2), object(2)
memory usage: 625.1+ KB
None

In [ ]:
print(df['rank'].describe())

count    20000.000000
mean      5000.504950
std       2886.832079
min          1.000000
25%       2500.750000
50%       5000.500000
75%       7500.250000
max      10014.000000
Name: rank, dtype: float64

In [ ]:
proporcao_genero = df['sexo'].value_counts(normalize=True)
print('Proporção genero:',proporcao_genero)

Proporção genero: sexo
F    0.5
M    0.5
Name: proportion, dtype: float64

In [ ]:
#Nomes mais comuns
nomes_mais_comuns = df.groupby('nome').sum().sort_values(by='freq', ascending=False).head(10)
print(nomes_mais_comuns)

               freq  rank sexo
nome
MARIA      11734129   282   FM
JOSE        5754529   548   FM
ANA         3089858   755   FM
JOAO        2984119   790   FM
ANTONIO     2576348  1008   FM
FRANCISCO   1772197  1174   FM
CARLOS      1489191  1292   FM
PAULO       1423262  1422   FM
PEDRO       1219605  1302   FM
LUCAS       1127310   894   FM

In [ ]:
#Nomes menos comuns
nomes_menos_comuns = df.groupby('nome').sum().sort_values(by='freq', ascending=True).head(10)
print(nomes_menos_comuns)

            freq  rank sexo
nome
RUBIAN       265  9993    M
LEOZIR       265  9992    M
MARONE       265  9981    M
KENID        265  9983    M
DEUSDEDITH   265  9982    M
NEILTO       265  9988    M
CLAUDEONOR   265  9995    M
LIZEU        265  9984    M
CARLOA       265  9991    M
JAILAN       265  9980    M